[
  {
    "link": "https://www.indiatvnews.com/technology/news-apple-iphone-12-series-pricing-leaked-ahead-of-october-launch-654015",
    "title": "Apple iPhone 12 series pricing leaked ahead of October launch: Here are the details",
    "date": "5 hours ago",
    "urls": [],
    "content": "Image Source : EVERYTHINGAPPLEPRO Apple iPhone 12 series is expected to launch on October 13.\n\nApple iPhone 12 series launch is due for this month and everyone is excited about it. Every year, new iPhone models arrive in the month of September but due to the ongoing COVID-19 pandemic, the Cupertino based company had to delay the launch. The iPhone 12 series is expected to launch via an online-only launch event on October 13. Ahead of the launch event, the prices of the upcoming iPhones have surfaced the internet.\n\nAccording to a recent report, Apple will be launching four iPhone 12 models this year. The upcoming lineup will consist of the iPhone 12 Mini, iPhone 12, iPhone 12 Pro and iPhone 12 Pro Max. As the naming scheme makes it clear, the iPhone 12 Mini will be a new addition to the family whereas the other three will be an upgrade to the iPhone 11 series.\n\nAs per a recent report by Apple RUMORs, the iPhone 12 Mini will launch with a starting price tag of $649 (roughly Rs. 47,500) for the 64GB storage variant. The smartphone will also get a 128GB and a 256GB variant priced at $699 (roughly Rs 51,000) and $799 (roughly Rs 58,500), respectively.\n\nAs for the iPhone 11 successor iPhone 12, it will be priced at $749 (roughly Rs 55,000) for the 64GB storage variant. The 128GB variant will be priced at $799 (roughly Rs 58,500) whereas the 256GB variant will come in at a price of $899 (approximately Rs 66,000).\n\nThe iPhone 12 Pro’s base variant will come with 128GB storage and it is said to be priced at $999 (roughly Rs 73,000). The smartphone will also come in 256GB and 512GB storage options priced at $1,099 (roughly Rs 80,500) and $1,299 (roughly Rs 95,000), respectively.\n\nLastly, the iPhone 12 Pro Max will reportedly start at $1,099 (roughly Rs 80,500) for the 128GB storage variant. While the 256GB variant will be available at a price of $1,199 (roughly Rs 88,000), the 512GB variant will set you back $1,399 (roughly Rs 1,02,500) for the 512GB storage option.\n\nIn contradiction, leakster iAppleTimes said that the iPhone 12 models will be at least $50 more expensive than the prices stated above. However, all this can be taken with a pinch of salt as we will need to wait for the official launch to know about the pricing.\n\nLatest Technology News\n\nFight against Coronavirus: Full coverage",
    "authors": [
      "New Delhi",
      "Image Source"
    ],
    "polarity": -0.03363636363636365,
    "sentiment": "negative",
    "subjectivity": 0.4081168831168832
  },
  {
    "link": "https://www.bgr.in/news/apple-iphone-12-prices-leaked-iphone-12-mini-649-iphone-12-pro-999-iphone-12-iphone-12-pro-max-917842/",
    "title": "Apple iPhone 12 prices leaked, iPhone 12 Mini to start at $649",
    "date": "7 hours ago",
    "urls": [],
    "content": "Apple is expected to announce the iPhone 12 line-up on October 13. The Cupertino-based tech giant looks set to launch four new iPhones this year, namely iPhone 12, iPhone 12 Mini, iPhone 12 Pro, and iPhone 12 Pro Max. These phones have been the subject of numerous leaks and speculations over the past few months. Now, a new leak has shed some light on the prices of these smartphones. Also Read - India may soon announce its own ‘Atmanirbhar’ app store as alternative to Google, Apple\n\nAccording to the leak, the iPhone 12 Mini will be priced at $649 (roughly Rs 47,000) for the 64GB storage variant, $699 (roughly Rs 51,400) for the 128GB model, and at $799 (roughly Rs 58,800) for the top-of-the-line 256GB storage variant. The iPhone 12 will be priced at $749 (roughly 55,100) for the 64GB storage variant, $799 (roughly Rs 58,800) for the model with 128GB internal storage, and at $899 (roughly Rs 66,100) for the 256GB storage variant. Also Read - iPhone 12 probably not shipping with Apple EarPods, hints iOS 14 codes\n\nWatch: Everything you need to know about Apple Watch Series 6, Apple Watch SE, New iPad Air, & More\n\nThe leak also sheds some light on the pricing of the Pro models. Reportedly, the iPhone 12 Pro will be priced at $999 (roughly Rs 73,500) for the 128GB storage variant, $1099 (roughly Rs 80,900) for the 256GB storage variant, and the high-end 512GB model will retail for $1299 (roughly Rs 95,600). Lastly, the iPhone 12 Pro Max will be priced at $1099 (roughly Rs 80,900) for the 128GB variant, $1199 (roughly Rs 88,200) for the 256GB model, and at an eye-watering $1399 (roughly Rs 1,02,900) for the variant with 512GB storage. Also Read - Apple iPhone 12 Mini could cost $700, lack 5G connectivity; Here’s everything we know about the compact smartphone\n\niPhone 12: Everything we know\n\nThe iPhone 12 Mini is expected to have a 5.4-inch screen. The iPhone 12 Pro and iPhone 12 Pro Max on the other hand are set to come with 6.1-inch and 6.7-inch screens respectively. The regular iPhone 12 is also rumored to feature a 6.1-inch display. All the new iPhones are expected to be powered by the new A14 Bionic chipset, which was revealed at Apple’s recent ‘Time Flies’ event. Additionally, Apple is set to reduce the size of the notch and introduce an iPad Pro like design with flatter edges. All iPhone 12 models except the iPhone 12 Mini will support 5G connectivity.",
    "authors": [],
    "polarity": 0.009718614718614724,
    "sentiment": "positive",
    "subjectivity": 0.4064185814185815
  },
  {
    "link": "https://www.theverge.com/circuitbreaker/2020/10/2/21498857/apple-foldable-self-healing-display-patent-application",
    "title": "Apple imagines a foldable iPhone with a ‘self-healing’ display",
    "date": "16 hours ago",
    "urls": [],
    "content": "An Apple patent application published yesterday reveals an idea for a foldable smartphone that would include a “self-healing” display cover, allowing the device to repair dents or scratches covering the screen. The application, spotted by Patently Apple, was originally filed by Apple in January.\n\nAs Apple wrote in the patent application, the proposed concept’s display would allow the device to repair itself without the user having to manually intervene. In theory, the foldable’s self-healing could activate automatically, such as when the device is being charged or on a predetermined schedule, and it would use heat, light, or electric current to repair a protective layer above the screen.\n\nThe patent application also says the hypothetical device’s screen cover may include a layer of elastomer that can lose and regain its shape to keep the sensitive inner workings of a device protected. In theory, the material for this concept would make the foldable’s overall display cover more durable.\n\nBasic self-healing technology has been seen in at least one smartphone already\n\nSeveral tech companies, including Samsung and Motorola, are already making different styles of foldable phones, but Apple’s proposed self-healing feature would add a unique spin to these devices. Samsung’s first take on this type of foldable phone, the Galaxy Fold, suffered from issues with the durability of the screen’s display. The phone was delayed after several review units failed in quick succession, something my colleague Dieter Bohn encountered in his review unit.\n\nBasic self-healing technology has been seen in at least one smartphone already, LG’s G Flex from 2013. It had a self-healing rear cover that was supposed to repair minor scrapes, such as a knife scratch. It wasn’t that effective, though: it could not recover from a key scratch during our testing, with our reviewer comparing it to Wolverine if he could only heal from “paper cuts and nothing else.”\n\nThere is no indication that Apple will launch a foldable phone with self-healing material soon, if at all. But foldable phones are something Apple appears to have been toying around with for years, with other patent applications showing mockups of what a foldable iPhone could look like should it ever come to fruition.",
    "authors": [
      "Taylor Lyles",
      "Oct"
    ],
    "polarity": 0.06378205128205128,
    "sentiment": "positive",
    "subjectivity": 0.44903846153846155
  },
  {
    "link": "https://timesofindia.indiatimes.com/business/india-business/apple-leases-4-lakh-sqft-bengaluru-office-space/articleshow/78456887.cms",
    "title": "Apple leases 4 lakh sqft Bengaluru office space",
    "date": "9 hours ago",
    "urls": [],
    "content": "BENGALURU: Apple has leased about 4 lakh sqft of commercial office space in Bengaluru’s central business district , people familiar with the matter said.\n\nThis is the US-based tech giant’s biggest real estate deal in the country.\n\nApple has signed the lease with Prestige Estates at its Minsk Square building and will pay a rental of Rs 170 per sqft, which works out annually to Rs 82 crore. Apple and Prestige did not respond to requests for comment.\n\nThe deal has coincided with the iPhone-maker launching its online retail store in the country, which it did last month. The company, which is already making smartphones in India, has also announced it will open its first physical store in Mumbai next month.\n\nThe new office space will host a large technology centre. The space would normally accommodate about 4,000 employees, but the numbers may be less as companies look to ‘de-densify’ their work spaces due to the pandemic. Apple advertised vacancies\n\nfor 18 jobs last month on its website, out of which seven are in Bengaluru and the rest across Hyderabad, Chennai and Gurgaon.\n\nApple has an existing lease of 50,000 sqft in the northern part of the city with RMZ, but sources said the company may give up on that and consolidate its operations in the CBD zone.\n\n",
    "authors": [],
    "polarity": 0.06462391774891774,
    "sentiment": "positive",
    "subjectivity": 0.3208942099567099
  },
  {
    "link": "https://www.republicworld.com/technology-news/mobile/iphone-12-release-date-and-details-find-out-about-the-new-iphone.html",
    "title": "Apple Accidentally Reveals Details About IPhone 12 Before Its Release, Find Out",
    "date": "4 hours ago",
    "urls": [],
    "content": "The American multinational technology company Apple has been using a mysterious launch strategy for its iPhone 12 range. It looks as though this new strategy is working in Apple’s favour as it has attracted a lot of attention among consumers. However, in the latest development, Apple accidentally revealed a new release detail about the iPhone 12. Read on to find out.\n\nRead | iPhone 12 Mini To Cost $700 But Shall Not Have 5G Connectivity: Reports\n\niPhone 12 Release details\n\nThe release detail was spotted by MacRumors, a popular blog on Apple products. It revealed that Apple had included wording in its new iOS 14.2 beta which confirms that it will not bundle EarPods with its upcoming iPhones. This means that iPhone 12 will not contain the complementary Apple EarPods.\n\nThe blog further mentions that one of the major reasons behind this decision by Apple may be increasing popularity AirPods. Many people will applaud the technology giants move, which reportedly is aimed at helping the environment. Millions of Apple users often leave the earphone unused, in the box. However, there is a catch to this new move by Apple.\n\nRead | Billie Eilish's documentary to release in theaters in US and on Apple TV in February 2021\n\nThe blog further stated that Apple will also be removing its complimentary wall charger, which usually comes along with the phone. While describing this discovery MacRumors pointed out that in iOS 14 and earlier versions of iOS, Apple has mentioned about reducing exposure to radiofrequency energy by using the ‘supplied headphones.’ But in iOS 14.2, the word “supplied” has been removed. This change might look subtle and the environmental benefits indisputable, but it seems like there might be more to this decision than meets the eye. The blog states that this move could lead to a further expansion of the AirPods range by Apple and also a new magnetic wireless charging accessory may be deemed opportunistic.\n\nRead | Taiwanese Apple contract manufacturers to invest $900 million in India: Report\n\nRead | Fortnite versus Apple case: Know all about Epic vs Apple court hearing\n\niPhone 12 Release date\n\nWhen does iPhone 12 come out?\n\nApple had held a September virtual event which focused on the new Apple Watch 6, Apple Watch SE and iPads instead. Hence, the announcement date for the iPhone 12, 12 Pro, 12 Max and possible 12 Pro Max remains mysteriously unclear. However, CNET has guessed that it might come out by Oct. 13 or 14.\n\nMacRumors also predicted that Apple will the releasing iPhone 12 mini in its iPhone 12 range which would have a screen of 5.4 inches. Reportedly, iPhone 12 would have a screen as big as 6.1 inches. Similarly, iPhone 12 Pro would have a 6.1-inch screen as well. On the other hand, iPhone Pro Max would have a screen size of 6.7 inches.\n\nImage source: Apple Insider Twitter Handle",
    "authors": [],
    "polarity": 0.08115530303030302,
    "sentiment": "positive",
    "subjectivity": 0.5090097402597402
  },
  {
    "link": "https://www.apple.com/leadership/greg-joswiak/",
    "title": "Apple Leadership - Greg Joswiak",
    "date": "3 hours ago",
    "urls": [],
    "content": "Greg “Joz” Joswiak is Apple’s senior vice president of Worldwide Marketing, reporting to CEO Tim Cook.\n\n\n\nSince joining Apple in June 1986, Joz has played a pivotal role in developing and launching some of the world’s most beloved consumer products, including the original iPod and iPhone. Joz began his career at Apple working on the early Macintosh computers and supporting the Mac’s community of third-party developers.",
    "authors": [],
    "polarity": 0.40416666666666673,
    "sentiment": "positive",
    "subjectivity": 0.6
  },
  {
    "link": "https://www.theverge.com/2020/10/2/21498931/apple-spatial-audio-airpods-pro-surround-sound-quick-auto-switching",
    "title": "Apple’s new spatial audio feature turns the AirPods Pro into a home theater for your ears",
    "date": "17 hours ago",
    "urls": [],
    "content": "Since releasing them last year, Apple has quietly continued to improve upon the AirPods Pro with firmware updates that have tweaked their noise cancellation and sound quality. The company rarely details or comments on the changes that come in each release of AirPods firmware; there are no update notes that spell out what’s new. Nor is there any way to manually force install the latest AirPods / AirPods Pro software. It just... happens in the background at some point as you use them. But last month, the AirPods Pro picked up a pair of new features that Apple did announce: spatial audio and automatic switching.\n\nAutomatic switching is the simpler one, and it’ll probably make a bigger difference to your day-to-day use of the AirPods Pro. (It’s also be available on standard AirPods and select Beats headphones and earbuds.) Without you having to do anything, the AirPods will automatically switch between your iPhone, iPad, and Mac whenever you start using one of them. This handoff is nearly instantaneous; you can be listening to music on your phone, pause it, pick up your iPad and start playing a video, and the AirPods will be ready for that audio. Since macOS Big Sur is required (and still hasn’t officially shipped), the Mac part of this equation doesn’t really work yet. But when hopping back and forth between my iPhone and iPad Pro, automatic switching has worked just as advertised.\n\nThen there’s spatial audio, which is exclusive to the AirPods Pro. With this feature, Apple is trying to cram an immersive surround sound experience into two earbuds. I’m still surprised and impressed by how well the company pulled it off. Instead of hearing everything in stereo like usual, it really does feel more like you’re in the middle of the action when you’re playing content in an app that supports spatial audio. And so far, quite a few do — including Apple TV, Disney Plus, and HBO Max. Netflix and Amazon Prime Video aren’t on board just yet.\n\nApple says it uses algorithms to convert surround sound (5.1, 7.1, or Dolby Atmos) into spatial audio. From there, it applies directional audio filters and adjusts the frequencies going to each ear to achieve the immersion effect. How much of a difference spatial audio makes obviously varies by content. A Marvel film on Disney Plus is going to give you a more riveting audio experience than, say, Ted Lasso on Apple TV. (But Tom Hanks’ Greyhound makes for good demo material on that service.)\n\nThese devices support spatial audio with AirPods Pro: iPhone 7 / 7 Plus and all later iPhones\n\niPad Pro 12.9‑inch (third generation and later)\n\niPad Pro 11‑inch\n\niPad Air (third generation and later)\n\niPad (sixth generation and later)\n\niPad mini (fifth generation) iOS 14 / iPadOS 14 or later is required for spatial audio.\n\nEarbuds are never going to fully rival the experience of watching a movie through a top-tier Atmos system in a home theater. But just as the name says, spatial audio makes everything feel more wide and open. Sure, the directional surround effects are neat, but the expansive sound field also pays off big for dialog clarity. Speech cuts through the mix without any problems, which you can’t always say about stereo audio. Even if the end result isn’t revelatory, spatial audio makes watching movies with your AirPods Pro that much better and more three-dimensional.\n\nThe more impressive aspect of spatial audio is how it keeps audio fixed in place and tricks you into thinking that the sound really is coming from your iPhone or iPad — almost as though you’re looking at a TV screen. When you turn your head left or right, the primary audio channel stays planted in front of you. Apple does this by comparing the motion data from the sensors in your device with the gyroscope and accelerometer inside the AirPods Pro. That’s how it detects if you move your head or if you raise or lower your iPad. You’ll still hear some of the enveloping surround mix in each ear when turning from side to side.\n\nI’m impressed by spatial audio in the AirPods Pro, but I’m even more excited about how this could all sound when Apple eventually unveils its long-rumored over-ear headphones. Putting this tech into full-size headphones will give the company even more to work with and could solidify the iPad as the ultimate portable movie machine.",
    "authors": [
      "Chris Welch",
      "Oct"
    ],
    "polarity": 0.2390728124334682,
    "sentiment": "positive",
    "subjectivity": 0.40328460246493025
  },
  {
    "link": "https://timesofindia.indiatimes.com/gadgets-news/apple-watch-series-6-series-se-go-on-sale-in-india-prices-and-discount-offers/articleshow/78447352.cms",
    "title": "Apple Watch Series 6, Series SE go on sale in India: Prices and discount offers",
    "date": "23 hours ago",
    "urls": [],
    "content": "\n\nApple’s latest wearable devices — Watch Series 6 and Watch Series SE — have gone on sale in India. The two devices were launched last month — along with iPad Air and eighth-generation iPad during a virtual event.\n\nApple Watch Series 6: Price\n\nApple Watch Series 6 comes in two case sizes — 40mm and 44mm that are priced at Rs 40,900 and Rs 43,900 for the GPS only variant. As for the GPS+Cellular variant, the 40mm screen variant costs Rs 49,900 and the 44mm screen variant costs Rs 52,900.\n\nApple Watch Series 6: Launch offers include flat Rs 3,000 instant discount on transactions made with HDFC Bank credit cards, credit/debit EMI transactions.\n\n-Flat Rs 1,500 off on purchases made via HDFC Bank debit cards\n\n-5% instant discount with HSBC cashback card\n\n-Flat 5% back with Amazon Pay ICICI Bank credit card for Prime members.\n\n-Flat 3% back for non-Prime members with Amazon Pay ICICI Bank credit card.\n\nApple Watch Series SE: Price\n\nThe Watch Series SE comes in two case sizes — 40mm and 44mm that are priced at Rs 29,900 and Rs 32,900 for the GPS only variant. As for the GPS+Cellular variant, the 40mm screen variant costs Rs 33,900 and the 44mm screen variant costs Rs 36,900.\n\nApple Watch Series 6: Launch offers\n\n- Flat Rs 2,000 instant discount with HDFC Bank credit card, credit/debit EMI transactions.\n\nFlat Rs 1,500 on HDFC Bank debit card\n\n-5% instant discount with HSBC cashback card\n\n-Flat 5% back with Amazon Pay ICICI Bank credit card for Prime members.\n\n-Flat 3% back for non-Prime members with Amazon Pay ICICI Bank credit card.\n\n",
    "authors": [
      "Timesofindia.Com",
      "Oct"
    ],
    "polarity": 0.022727272727272717,
    "sentiment": "positive",
    "subjectivity": 0.3015151515151515
  },
  {
    "link": "https://www.business-standard.com/article/international/apple-sues-firm-for-reselling-100-000-devices-meant-for-recycling-120100300532_1.html",
    "title": "Apple sues firm for reselling 100,000 devices meant for recycling",
    "date": "1 hour ago",
    "urls": [],
    "content": "In a bizarre incident, has sued electronic recycling company GEEP Canada for allegedly stealing and reselling nearly one lakh iPhones, iPads and Watches it was supposed to destroy and recycle.\n\nAccording to a report in The Logic, said in a lawsuit that the resales \"damaged demand for new Apple products, created safety issues for consumers and hurt its brand\".\n\nApple is seeking full recovery of the profits made from the resale of these devices, plus $31 million Canadian dollars (US$22.7 million).\n\nOntario-based GEEP has denied all wrongdoing, filing a third-party counter lawsuit that claimed that three of its employees engaged in the theft without the firm's knowledge.\n\nApple, however, argued that these employees were part of senior management at the company.\n\nApple's lawsuit stated that the company shipped 531,966 iPhones to GEEP Canada for recycling between January 2015 and December 2017, along with 25,673 iPads, and 19,277 Apple Watches.\n\nApproximately 18 per cent or 103,845 of all those devices were reportedly discovered by Apple to \"be active on carrier networks\".\n\nApple said that the number of stolen devices will be considerably higher, since non-LTE ones wouldn't be shown.\n\n\"At least 11,766 pounds of Apple devices left GEEP's premises without being destroyed -- a fact that GEEP itself confirmed,\" Apple said in its lawsuit.\n\nApple is pioneering a new path to help push the recycling industry forward.\n\nThe tech giant has received nearly 1 million devices through Apple programmes and its recycling robot Daisy can disassemble 1.2 million devices per year.\n\nIn 2018, the company refurbished more than 7.8 million Apple devices and helped divert more than 48,000 metric tonnes of electronic waste from landfills.\n\n--IANS\n\nna/\n\n(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)",
    "authors": [],
    "polarity": 0.06378066378066378,
    "sentiment": "positive",
    "subjectivity": 0.4504329004329005
  },
  {
    "link": "https://www.theverge.com/2020/10/2/21499243/ios-14-watchos-7-battery-drain-apple-iphone-watch-fix",
    "title": "If iOS 14 is causing battery drain, you might need to wipe your iPhone",
    "date": "16 hours ago",
    "urls": [],
    "content": "Operating system updates can often suffer from unwanted glitches, and it seems that the latest iOS 14 and watchOS 7 releases from Apple are not immune. There have been complaints over the last few days that some people who have updated their devices have found — instead of increased efficiency — a wide range of issues, including missing fitness data, health apps that refuse to open, inaccurate reports of stored data, and increased battery drain on iPhones and Apple Watches. But while Apple has posted a way to resolve some of these issues, it’s not an easy fix.\n\nWhen we checked Twitter, there were quite a few irritable messages from users whose batteries were losing power way too quickly. For example, one user tweeted, “The battery drain is unbelievable. From 90 percent to 3 percent in one hour.” Most people aren’t having battery issues nearly as dire, but this does show the level of problems some are encountering.\n\n“If you haven’t done the iOS 14 update; DONT DO IT. The battery drain is unbelievable. From 90% to 3% in one hour.” @Apple @AppleSupport @apple — pratish gupta (@pratishgupta16) September 28, 2020\n\nApple has already issue one bug fix update (14.0.1), but none of these issues were part of that fix. Instead, Apple has suggested that if you’re experiencing “two or more” of the listed issues, you unpair your iPhone and your Apple Watch, back up to iCloud, erase all content from your iPhone, and then restore your iPhone and Apple Watch from the backups. Unfortunately, it looks like there is no way to restore missing workout route maps, environmental sound levels, or any other missing data — Apple suggests affected users follow its instructions “to prevent future data loss.”\n\nHaven’t updated yet? You may want to hold off for a few more days until Apple — and other iPhone / Apple Watch users — signals the all clear.",
    "authors": [
      "Barbara Krasnoff",
      "Oct"
    ],
    "polarity": 0.03266666666666666,
    "sentiment": "positive",
    "subjectivity": 0.4083333333333334
  }
]